int/resources/objectRepo/xmlTemplates/opera/CashieringConfig/req_FetchTemplateTransactionCodes.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:v9="http://micros/opera/ws/mdm/v9_00" xmlns:v91="http://micros/opera/ws/common/v9_00">
   <soapenv:Header/>
   <soapenv:Body>
      <v9:FetchTemplateTransactionCodesRQ EchoToken="?" TimeStamp="?" Version="?" CorrelationID="?">
         <v91:OperaContext>
            <v91:UserLanguage></v91:UserLanguage>
            <v91:CROCode></v91:CROCode>
            <v91:HotelCode></v91:HotelCode>
            <v91:Language></v91:Language>
            <v91:RunningApplication></v91:RunningApplication>
            <v91:TerminalId></v91:TerminalId>
            <v91:LogLevel></v91:LogLevel>
            <v91:ExternalSystem></v91:ExternalSystem>
            <v91:Override></v91:Override>
            <v91:TargetExternalSystem></v91:TargetExternalSystem>
            <v91:UseLocal></v91:UseLocal>
            <v91:ExternalData></v91:ExternalData>
         </v91:OperaContext>
         <v9:Criteria IncludeInactive="?" CompTransactionCodes="?">
            <v91:TransactionGroups>
               <v91:Code></v91:Code>
            </v91:TransactionGroups>
            <v91:TransactionSubgroups>
               <v91:Code></v91:Code>
            </v91:TransactionSubgroups>
            <v91:TransactionCodes>
               <v91:Code></v91:Code>
               <v91:WildCard></v91:WildCard>
            </v91:TransactionCodes>
            <v91:Description></v91:Description>
            <v91:BrandCode></v91:BrandCode>
            <v91:UniversalProductCode></v91:UniversalProductCode>
         </v9:Criteria>
      </v9:FetchTemplateTransactionCodesRQ>
   </soapenv:Body>
</soapenv:Envelope>
